# คำสั่งรับค่าข้อความ string ทางแป้นพิมพ์ ใช้ฟังก์ชั่น input()
# ****** ตัวแปร variable คือ ชื่อที่ Dev ตั้งขึ้นมาเอง (ต้องเป็นไปตามกฏการตั้งชื่อ) เอาไว้เก็บช้อมูลที่เกิดขึ้นในโปรแกรม
# ฟั่งก์ชั้นแปลงข้อความเป็นตัวเลข int() float()

fullmane = input('ป้อนชื่อ: ')
year_born = input('ป้อนปีเกิด พ.ศ.: ')
print('--------------------------------')
print(f'สวัสดีคุณ {fullmane}')
print(f'คุณเกิดปี {year_born} ตอนนี้อายุคุณ {2568 - int(year_born)}')
print('--------------------------------')
# ใช้ ,
print('สวัสดีคุณ',fullmane)
print('คุณเกิดปี',year_born,'ตอนนี้อายุคุณ',2568 - int(year_born))
print('--------------------------------')
# ใช้ +
print('สวัสดีคุณ'+fullmane)
print('คุณเกิดปี'+str(year_born)+'ตอนนี้อายุ'+str(2568- int(year_born)))
# ใช้ format
print(f'สวัสดีคุณ {fullmane}')
print(f'คุณเกิดปี {year_born} ตอนนี้อายุคุณ {2568 - int(year_born)}')
print('--------------------------------')