# Control Flow แบ่งเป็น 2 กลุ่ม / Control statement แยกเป็น 2 กลุ่ม 
# 1.Selection / Decision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น 3 แบบย่อยๆ
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ  (if)
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จทำ    (if-else)
# - พิสูจน์ตรวจสอบหลายครั้ง  (if-elif-else)

# 2. Loop / Iteration / Repetition ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ แยกเป็น 2 แบบ  
# - รู้จำนวนเครั้งในการทำซ้ำ
# - ไม่รู้จำนวนเครั้งในการทำซ้ำ
# - while, for 
# *** สิ่งที่ต้องระวังในการทำซ้ำ คือ ต้องรู้จบ 

# *** statement ที่เกี่ยวกับ Control Flow คือ break , continue โดยเฉพาะ Loop