# คำสั่งรับค่าข้อความ string ทางเป็นพิมพ์ ใช้ฟังก์ชั่น input()
# ******* ตัวแปร veriabie คือ ชื่อที่ Dev ตั้งชขึ้นมาเอง (ต้องเป็นไปตามกฎการตั้งชื่อ) เอาไว้เก็บข้อมูลที่เกิดขึ้นในโปรแกรม

fullname = input('ป้อนชื่อ: ')
year_born = input('ป้อนปีเกิด พ.ศ.: ')
print('-----------------')
print(f'สวัสดีคุณ{fullname}')
print(f'คุณเกิดปี{year_born} ตอนนี้คุณอายุ {2568 - int(year_born)}')

# ใช้ ,
print('-----------------')
print(f'สวัสดีคุณ,fullname,')
print(f'คุณเกิดปี,year_born, ตอนนี้คุณอายุ {2567 - int(year_born)}')

