#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า "รถทะเบียน ???? 
# น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" 
# โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์

# โปรแกรมตรวจสอบน้ำหนักรถบรรทุก

license_plate = input("กรุณาป้อนทะเบียนรถบรรทุก: ")
weight = float(input("กรุณาป้อนน้ำหนักรถบรรทุก (หน่วยกิโลกรัม): "))

if weight > 1000:
    print(f"รถทะเบียน {license_plate} น้ำหนักรถไม่ผ่านเกณฑ์")
else:
    print(f"รถทะเบียน {license_plate} น้ำหนักรถผ่านเกณฑ์")