# โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
#    ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
#     ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
#     ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
#     ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย

# โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย

emp_id = input("กรุณาป้อนรหัสพนักงาน: ")
emp_name = input("กรุณาป้อนชื่อพนักงาน: ")
sales_amount = float(input("กรุณาป้อนยอดขาย (บาท): "))

if sales_amount <= 1000:
    commission = 0.0
elif 1001 <= sales_amount <= 2000:
    commission = sales_amount * 0.01
elif 2001 <= sales_amount <= 3000:
    commission = sales_amount * 0.03
else:
    commission = sales_amount * 0.05

print("สรุปผลการคำนวณค่าคอมมิชชั่น")
print("รหัสพนักงาน:", emp_id)
print("ชื่อพนักงาน:", emp_name)
print("ยอดขาย: {:.2f} บาท".format(sales_amount))
print("ค่าคอมมิชชั่น: {:.2f} บาท".format(commission))