# โปรแกรมทายตัวเลข โดยมีการทำงานของโปรแกรมดังนี้
# - ให้ผู้ใช้ทายตัวเลขโดยการป้อนตัวเลขทางแป้นพิมพ์
# - โดยกรณีที่ตัวเลขที่ป้อนมีค่าเท่ากับ 59 ให้แสดงข้อความ “ยินดีด้วยคุณทายถูก”
# - แต่หากตัวเลขที่ป้อนมีค่ามากหรือน้อยกว่า 59 ให้แสดงข้อความ 
# “คุณทายผิดตัวเลขที่ป้อนมากไป” หรือ “คุณทายผิดตัวเลขที่ป้อนน้อยไป” และให้ผู้ใช้ป้อนใหม่  โดยโปรแกรมจะวนให้ผู้ใช้ป้อนไปเรื่อยๆ จนกว่าจะทายถูก

# โปรแกรมทายตัวเลข
# ให้ผู้ใช้ทายตัวเลขจนกว่าจะทายถูก

print("****************************************")
print("**** ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ ****")
print("****************************************")

# กำหนดตัวเลขที่ต้องทาย
target_number = 59

while True:
    try:
        guess = int(input("ป้อนตัวเลขที่ต้องการทาย : "))
        
        if guess == target_number:
            print("ยินดีด้วยคุณทายถูก")
            break
        elif guess < target_number:
            print("คุณทายผิดตัวเลขที่ป้อนน้อยไป")
        else:
            print("คุณทายผิดตัวเลขที่ป้อนมากไป")
        
        print("*****************************************")
    except ValueError:
        print("กรุณาป้อนตัวเลขที่ถูกต้อง")