# กรณี 1 print() มีข้อมูลหลายประเภททำไง??? มี 4 วิธี
# วิธีที่ 1 , (โดยการแสดงผลตรงจุด , )
print('Hello','Wow',999,True,'HI',10 + 20,152.875)

# วิธีที่ 2 ใช้ + (ข้อมูลไหนที่ไม่ใช่ Staring ต้องทำให้เป็น Staring ใช้ปั่งก์ชั่น Str())
# ไม่มีเว้น 1 Space เหนือน ,
print('Hello'+str(555)+'Wow'+str(999)+str(True)+'HI'+str(10 + 20 -5)+str(152.875))
print('Hello '+str(555)+ 'Wow '+str(999)+' '+str(True)+' HI '+str(10 + 20 -5)+' '+str(152.875))

# วิธีที่ 3 ใช้เทธอด Format() โดนข้อมูลที่แสดงอยู่ในรูปแบบของ Staring
# (ข้อมูลที่ไม่ใช่ Staring  ให้ใส่ () ของ Format และตำแหน่งข้อมูลนั้นให้ใส่ {} แทน)
print('Hello {} Wow {} {} HI {} {}'.format(555,999,True,10+20-5,152.875))
# index number 0 1 2 3 4 
print('{2} {4}'.format('a','b','c','d','e'))

# วธีที่ 4 ใช่ f-string โดยข้อมูลที่แสดงอยู่ในรูปแบบของ String โดยมี F อยู่ข้างหน้า
# (ช้อมูลที่ไม่ใช่ string ให้เขียนใน {} ณ ตำแหน่งนั้นๆ เลย)
print(f'Hello {555} Wow {999} {True} Hi {10+20-5} {152.875}')